README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org2cff08f)
2.  [Resumo e/ou informação extra:](#orgd446856)
3.  [Versão:](#org4d3a002)
4.  [Data:](#org0bfb7e4)
5.  [Autor de Contato:](#org76003ca)
6.  [Lista dos Autores:](#org2a8365e)
7.  [Áreas de pesquisa vinculadas:](#orgee431d8)
8.  [Vinculo com:](#org76ef6c9)
9.  [Paradigmas:](#orgc67c46b)
10. [Tipo de Interface:](#org6cb0e1b)
11. [Plataformas Suportadas:](#orgfc2a098)
12. [Linguagens Utilizadas:](#org64c8d71)
13. [Bibliotecas Utilizadas (dependências):](#org6453c51)
14. [Softwares utilizados (dependências)](#org02e0342)
15. [Tipo de Licença:](#orgeb83d97)
16. [Links:](#orgbe9a951)


<a id="org2cff08f"></a>

# Nome do Software (ou Biblioteca):

-   SIMULADOR DE HIDRÁULICA DE PERFURAÇÃO DE POÇO - SHPP


<a id="orgd446856"></a>

# Resumo e/ou informação extra:

-   Desenvolver um simulador de hidráulica de poço que execute cálculos e gere

gráficos. Para tal, deve-se usar as equações de perda de carga provenientes da
mecânica dos fluidos adaptadas à indústria do petróleo.


<a id="org4d3a002"></a>

# Versão:

-   1.0.


<a id="org0bfb7e4"></a>

# Data:

-   2017/2 - segundo semestre (entregue 2018-2 - greve).


<a id="org76003ca"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org2a8365e"></a>

# Lista dos Autores:

-   GLEISON MONTEIRO ALVES
-   LUÍSA FIGUEIREDO CAMPBELL
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgee431d8"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Poço


<a id="org76ef6c9"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgc67c46b"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org6cb0e1b"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgfc2a098"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org64c8d71"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org6453c51"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org02e0342"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orgeb83d97"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orgbe9a951"></a>

# Links:

